In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
np.__version__

'2.0.0'

In [4]:
pd.__version__

'2.2.2'

In [8]:
df = pd.DataFrame({
    'features': [1.6, 3.9, 2., 6.9],
    'labels': [1, 2, 3, 4]
})
df

   features  labels
0       1.6       1
1       3.9       2
2       2.0       3
3       6.9       4

In [9]:
df.columns = ['features', 'label']
df

   features  label
0       1.6      1
1       3.9      2
2       2.0      3
3       6.9      4

In [10]:
iris = sns.load_dataset('iris')
iris.sort_values('species', ascending=False)

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

In [13]:
iris.value_counts('species').to_frame('quantity')

            quantity
species
setosa            50
versicolor        50
virginica         50

In [18]:
len(iris[(iris.petal_length <= 1.4) | (iris.petal_length >= 1.6)])

137

In [20]:
iris['petal_stats'] = iris.apply(lambda x: min(x.petal_length, x.petal_width), axis=1)

In [21]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  petal_stats
0           5.1          3.5           1.4          0.2  setosa          0.2
1           4.9          3.0           1.4          0.2  setosa          0.2
2           4.7          3.2           1.3          0.2  setosa          0.2
3           4.6          3.1           1.5          0.2  setosa          0.2
4           5.0          3.6           1.4          0.2  setosa          0.2

In [25]:
pd.pivot_table(iris, values=['sepal_width', 'petal_width'], columns=['species'], aggfunc=[np.mean, np.median])

C:\Users\berna\AppData\Local\Temp\ipykernel_19184\3673322301.py:1: FutureWarning: The provided callable <function mean at 0x000001C632EF8400> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(iris, values=['sepal_width', 'petal_width'], columns=['species'], aggfunc=[np.mean, np.median])
C:\Users\berna\AppData\Local\Temp\ipykernel_19184\3673322301.py:1: FutureWarning: The provided callable <function median at 0x000001C63302E480> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  pd.pivot_table(iris, values=['sepal_width', 'petal_width'], columns=['species'], aggfunc=[np.mean, np.median])

              mean                      median
species     setosa versicolor virginica setosa versicolor virginica
petal_width  0.246      1.326     2.026    0.2        1.3       2.0
sepal_width  3.428      2.770     2.974    3.4        2.8       3.0

In [28]:
left = pd.DataFrame({'key': ['jamie', 'bill'], 'lval': [15, 22]})
left = left.set_index('key')
left

       lval
key
jamie    15
bill     22

In [29]:
right = pd.DataFrame({'key': ['jamie', 'bill', 'asher'], 'rval': [4, 5, 0]})
right = right.set_index('key')
right

       rval
key
jamie     4
bill      5
asher     0

In [30]:
inner = pd.merge(left, right, on='key', how='inner')
inner

       lval  rval
key
jamie    15     4
bill     22     5

In [31]:
outer = left.join(right, how='outer')
outer

       lval  rval
key
asher   NaN     0
bill   22.0     5
jamie  15.0     4

In [35]:
fib = pd.Series([1,1,2,3,5,8])
vals = fib.values
dataf = vals.reshape(2, 3)
dataf

array([[1, 1, 2],
       [3, 5, 8]])

In [37]:
dataf.shape

(2, 3)

In [38]:
cats = pd.DataFrame({
    'breed': ['persian', 'persian', 'siamese', 'himalayan', 'burmese'],
    'color': ['calico', 'white', 'seal point', 'cream', 'sable']
})
cats

       breed       color
0    persian      calico
1    persian       white
2    siamese  seal point
3  himalayan       cream
4    burmese       sable

In [39]:
dumcats = pd.get_dummies(cats, prefix=['b', 'c'])
dumcats

,b_burmese,b_himalayan,b_persian,b_siamese,c_calico,c_cream,c_sable,c_seal point,c_white
0,False,False,True,False,True,False,False,False,False
1,False,False,True,False,False,False,False,False,True
2,False,False,False,True,False,False,False,True,False
3,False,True,False,False,False,True,False,False,False
4,True,False,False,False,False,False,True,False,False